Repository: jaimediazz/portfolio-jaime
Catalog: src/resources/locales/messages.*.xlf
Languages: es

source: Home
es: Inicio

source: Projects
es: Proyectos

source: Language
es: Idioma

source: arrow down
es: flecha abajo

source: <a href="/es/">Spanish</a>
es: <a href="/es/">Español</a>

source: <a href="/en/">English</a>
es: <a href="/en/">Inglés</a>

source: profileImage
es: imagen perfil

source: Junior Developer
es: Desarrollador Junior

source: Web and app front-end
es: Web y app front-end

source: Graduated in Computer Science with a lot of desire and enthusiasm to learn about web development and mobile applications. In the short term I would like to work in major Spanish cities, such as Madrid or Barcelona and, in the long term, I would love to work in English speaking countries, such as Ireland or the United States.
es: Graduado en Informática con muchas ganas e ilusión por aprender sobre desarrollo web y aplicaciones móviles. A corto plazo me gustaría trabajar en grandes ciudades españolas, como Madrid o Barcelona y, a largo plazo, me encantaría trabajar en países de habla inglesa, como Irlanda o Estados Unidos.

source: Download CV
es: Descargar CV

source: Contact and social media
es: Contacto y redes sociales

source: Languages that I'm fluent in
es: Idiomas que domino

source: Spanish
es: Español

source: English
es: Inglés

source: assets/CV_Jaime_Díaz_en.pdf
es: assets/CV_Jaime_Díaz_es.pdf

source: Ip Address Tracker
es: Rastreador de Direcciones IP

source: This website allows you to introduce a IP address and see where it is located this device in a map. Also, the first time you enter, the application will place a marker on the map indicating where your public IP is coming from. To do this two APIs has been used, Leaflet for the map and IP GeoAPI by IPify to locate IP addresses.
es: Este sitio web le permite introducir una dirección IP y ver dónde se encuentra este dispositivo en un mapa. Además, la primera vez que entres, la aplicación colocará un marcador en el mapa indicando de dónde viene tu IP pública. Para ello se han utilizado dos APIs, Leaflet para el mapa e IP GeoAPI de IPify para localizar las direcciones IP.

source: Remote Work
es: Trabajo Remoto

source: Landing page of a fictitious company that bets on remote work to coordinate and carry out its functions from anywhere in the world.
es: Página principal de empresa ficticia que apuesta por el trabajo remoto para coordinarse y llevar a cabo sus funciones desde cualquier parte del mundo.

source: Job Listing
es: Listado de Trabajos

source: This web page shows a list of 10 jobs, which can be filtered by four different characteristics: role, level, technologies and tools used. To perform this filtering just click on one of the buttons located on the right side of the card. In addition, it has been programmed to work with any initial number of jobs.
es: Esta página web muestra un listado de 10 trabajos, que pueden ser filtrados por cuatro características distintas: rol, nivel, tecnologías y herramientas usadas. Para realizar este filtrado basta con pulsar uno de los botones situados en la parte de la derecha de la tarjeta. Además, se ha programado para que el número total de trabajos sea escalable.

source: Final Project
es: Proyecto Final (TFT)

source: This was my final degree work. The main objective of this project is to provide the Research Unit of the Insular University Hospital Complex Materno-Infantil with a web application for filtering genetic variants that facilitates the detection of those that cause or may cause pathologies in patients, thus being able to prevent them or personalize the treatment received by each of them.
es: Este fue mi trabajo de fin de grado. Su objetivo principal es proporcionar a la Unidad de Investigación del Complejo Hospitalario Universitario Insular Materno-Infantil una aplicación web de filtrado de variantes genéticas que facilite la detección de aquellas que causan o pueden causar patologías en los pacientes, pudiendo así prevenirlas o personalizar el tratamiento que recibe cada uno de ellos.
